lib/xml/deleteFromContacts.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:ser="http://service.admin.ws.five9.com/">
    <soapenv:Header/>
    <soapenv:Body>
        <ser:deleteFromContacts>
            <!--Optional:-->
            <crmDeleteSettings>
                <!--Optional:-->
                <allowDataCleanup>?</allowDataCleanup>
                <!--Optional:-->
                <callbackFormat>?</callbackFormat>
                <!--Optional:-->
                <callbackUrl>?</callbackUrl>
                <!--Optional:-->
                <countryCode>?</countryCode>
                <!--Optional:-->
                <failOnFieldParseError>?</failOnFieldParseError>
                <!--Zero or more repetitions:-->
                <fieldsMapping>
                    <columnNumber>?</columnNumber>
                    <!--Optional:-->
                    <fieldName>?</fieldName>
                    <key>?</key>
                </fieldsMapping>
                <!--Optional:-->
                <reportEmail>?</reportEmail>
                <!--Optional:-->
                <separator>?</separator>
                <skipHeaderLine>?</skipHeaderLine>
                <!--Optional:-->
                <crmDeleteMode>?</crmDeleteMode>
            </crmDeleteSettings>
            <!--Optional:-->
            <importData>
                <!--Zero or more repetitions:-->
                <values>
                    <!--Zero or more repetitions:-->
                    <item>?</item>
                </values>
            </importData>
        </ser:deleteFromContacts>
    </soapenv:Body>
</soapenv:Envelope>